[
    {
        "Title": "CAD Design",
        "Content": "A lot of my projects require 3D printing, which requires CAD design. I have a little experience in Fusion360 but I switched to Onshape recently."    
    },
    {
        "Title": "3D Printing",
        "Content": "I'm sort of a novice when it comes to the settings you can mess with, but I do have experience maintaining and repairing 3D printers."        
    },
    {
        "Title": "Robotics",
        "Content": "I have experience with microcontrollers on the smaller side, like the ESP32 or Arduino Nano, which I have used for smaller robotics projects."        
    },
    {
        "Title": "Soldering",
        "Content": "I am experienced with soldering from my various projects, and I am able to produce mostly clean joints."        
    },
    {
        "Title": "Project Organization & Tracking",
        "Content": "With all the projects I have made, I have learned how to keep track of my projects with applications like Trello, Miro, and Figma."        
    },
    {
        "Title": "Troubleshooting",
        "Content": "Of course with anything, errors or problems will occur, and with that I've learned multiple troubleshooting and debugging strategies."
    },
    {
        "Title": "Programming in Lua",
        "Content": "Lua was one of my very first languages, which I learned from Roblox Studio when I was young. It taught me the essential logic needed for programming."
    },
    {
        "Title": "Programming in C#",
        "Content": "C# is one of my most known langauges as it is quite versitile, I have used it for making applications, modding games, and creating games."
    },
    {
        "Title": "Programming in C++",
        "Content": "I have only used C++ for programming microcontrollers, so I've never had to mess with the STD namespace, instead I use a dumbed down veesion with Arduino."
    },
    {
        "Title": "Programming in Python",
        "Content": "I have used Python for parsing through text files to pull information out and analyzing images to detect movement."
    },
    {
        "Title": "Programming in Java",
        "Content": "I am currently in a CCP class which covers Java, but I consider myself experienced as it is similar to C# and I have distinguished the differences."
    },
    {
        "Title": "Programming in HTML/CSS",
        "Content": "I took a web-dev class in my Sophomore year of highschool which is where I started making websites like this."
    }
]